blog/double-key-press-issue-on-butterfly-keyboard.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>用软件的方式解决蝴蝶键盘问题</title>
<!-- 2019-08-25 Sun 15:44 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Siqing Mu" />
<link rel="shortcut icon" href="https://www.khow.me/blog/images/favicon.ico" /><link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">用软件的方式解决蝴蝶键盘问题</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 下载地址</a></li>
<li><a href="#sec-2">2. 安装</a></li>
</ul>
</div>
</div>
<p>
最近发现一款软件，貌似可以解决苹果蝶式键盘问题。如果你的碟式键盘也出现按某个键结果连出了两次或多次，你或许可以试试这个软件。当然，最好是拿到天才吧免费维修。另外虽然这款软件对「键连打」有效，但对多次按键也没有输出这种失效情况却无能为力。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 下载地址</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://github.com/aahung/Unshaky/releases">https://github.com/aahung/Unshaky/releases</a>
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 安装</h2>
<div class="outline-text-2" id="text-2">
<p>
双击安装后，回需要赋予该软件权限。 依次进入System Preferences -&gt; Security &amp; Privacy -&gt; Privacy (Tab) -&gt; Accessibility (Left panel)，勾选右边的该软件名称Unshaky.app。然后打开顶上菜单栏该软件图标配置，针对某个「键连打」情况设置延迟时间。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
            <script type="text/javascript">
            var disqus_shortname = 'seymer';
            (function() {
                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
            </script>
            <script>
              (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

              ga('create', 'UA-110114842-1', 'auto');
              ga('send', 'pageview');
            </script>
</div>
</body>
</html>